clear all;
A = [2,2,1,1; 2,3,2,1; 4,5,4,3; 6,5,1,1]; %кэоффиценты
B = [1; 1; 1; 5];
n = 4; 
Y = matr(A,B); 
X = gauss(A,B,n);

function X = gauss(A,B,n)
    X(1) = 0;
    X(2) = 0;
    X(3) = 0;
    X(4) = 0;
    check = 1;
    proverka = n;
    k = 1;
    while proverka > 1 %пока не обойдем все строки матрицы
        while k < n
            pr = -A(k+1,check)/A(check,check);
            for i = check:n
               A(k+1,i)=A(k+1,i)+A(check,i)*pr ;%реобразование строк от k+1 до n, используя коэффициент
               % пропорциональности pr, который вычисляется на каждой итерации цикла.
               % Затем вектор правой части B также корректируется.
            end
            B(k+1)=B(k+1)+B(check)*pr;
            k = k + 1;
        end
        proverka = proverka - 1;
        check = check + 1;
        k = check;
    end
    for i = n:-1:1
        X(i) = (B(i) - (A(i,4)*X(4)) - (A(i,3)*X(3)) - (A(i,2)*X(2)))/A(i,i);%На каждой итерации обратного хода 
        % вычисляется i-й элемент вектора решений X путем вычитания из
        % i-го элемента вектора правой части B суммы произведений коэффициентов i-й строки матрицы A и
        % соответствующих элементов вектора р
    end
end

function Y = matr(A,B)
   Y=inv(A)*B;
end